In [5]:
import pandas as pd
import numpy as np
import seaborn as sns

# Gruplama İşlemleri (Grouping)

In [2]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],"veri" : [10, 11, 52, 23, 43, 55]}, columns = ["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

Gruplama işlemi veri setinde yer alan kategorik değişkenlerin gruplarının yakalanması ve gruplar özelinde gruplama işlemlerinin yapılması işlemidir.

In [3]:
df.groupby("gruplar").mean() # gruplar sütununu gruplayıp veri sütununun ortalamasını aldık

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [4]:
df.groupby("gruplar").sum() # gruplar sütununu gruplayıp veri sütununun toplamını aldık

         veri
gruplar
A          33
B          54
C         107

- .groupby() fonksiyonu ile gruplama işlemleri yapılır. 
- sum(), mean(), count(), max(), min() gibi fonksiyonlar ile gruplama işlemleri yapılır.

In [7]:
df = sns.load_dataset("planets")

In [8]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [9]:
df.groupby("method")["orbital_period"].mean() # method sütununu gruplayıp orbital_period sütununun ortalamasını aldık

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [10]:
df.groupby("method")["year"].describe() # method sütununu gruplayıp year sütununun istatistiklerini aldık

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [11]:
personeller ={
    "Çalışan": ["Ahmet Yılmaz", "Mehmet Yılmaz", "Ayşe Yılmaz", "Fatma Yılmaz", "Zeynep Yılmaz"],
    "Departman": ["Muhasebe", "Muhasebe", "İnsan Kaynakları", "İnsan Kaynakları", "Muhasebe"],
    "Yaş" :[30,25,40,35,27],
    "Semt" : ["Ataşehir", "Ataşehir", "Beyoğlu", "Beyoğlu", "Ataşehir"],
    "Maaş" : [3000, 2500, 4000, 3500, 2700]
}

In [13]:
df = pd.DataFrame(personeller)
df

         Çalışan         Departman  Yaş      Semt  Maaş
0   Ahmet Yılmaz          Muhasebe   30  Ataşehir  3000
1  Mehmet Yılmaz          Muhasebe   25  Ataşehir  2500
2    Ayşe Yılmaz  İnsan Kaynakları   40   Beyoğlu  4000
3   Fatma Yılmaz  İnsan Kaynakları   35   Beyoğlu  3500
4  Zeynep Yılmaz          Muhasebe   27  Ataşehir  2700

In [14]:
df["Maaş"].sum() # Maaş sütununun toplamını aldık

15700

In [15]:
df.groupby("Departman")["Maaş"].sum() # Departman sütununu gruplayıp Maaş sütununun toplamını aldık

Departman
Muhasebe            8200
İnsan Kaynakları    7500
Name: Maaş, dtype: int64

In [16]:
df.groupby("Departman")["Maaş"].mean() # Departman sütununu gruplayıp Maaş sütununun ortalamasını aldık

Departman
Muhasebe            2733.333333
İnsan Kaynakları    3750.000000
Name: Maaş, dtype: float64

# İleri Toplulaştırma İşlemleri (Advanced Aggregation)

In [17]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],"degisken1" : [10, 23, 33, 22, 11, 99],"degisken2" : [100, 253, 333, 262, 111, 969]}, columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

.aggregate() fonksiyonu ile toplulaştırma işlemleri yapılır.

In [18]:
df.groupby("gruplar").aggregate(["min", np.median, max]) # gruplar sütununu gruplayıp diğer sütunların min, median ve max değerlerini aldık

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [19]:
df.groupby("gruplar").aggregate({"degisken1" : "min", "degisken2" : "max"}) # gruplar sütununu gruplayıp diğer sütunların min ve max değerlerini aldık

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## .filter() 
- .filter() fonksiyonu ile gruplama işlemlerinden sonra gruplar üzerinde filtreleme işlemi yapılır.

In [20]:
def filter_func(x):
    return x["degisken1"].std() > 9

df.groupby("gruplar").filter(filter_func) # gruplar sütununu gruplayıp diğer sütunların standart sapması 9'dan büyük olanları aldık

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969